10-04-2016-Disk-encryption-and-incomplete-metadata-format-on-OpenBSD-5.9.org
#+TITLE: [[file:index.html][=stephen=]] 
#+AUTHOR:    Stephen Maxwell
#+OPTIONS: whn:nil
#+LINK_HOME: http://stephenmaxwell.me

* Disk encryption and incomplete metadata format on OpenBSD 5.9


This is a brief summary of a user error during full disk encryption on [[https://en.wikipedia.org/wiki/OpenBSD][OpenBSD]] which results in the error message ~softraid0: Invalid metadata format~.

As per the manual, encryption is handled by [[http://man.openbsd.org/softraid][softraid]] and [[http://man.openbsd.org/OpenBSD-6.0/bioctl.8][bioctl]] and should configured during the initial boot install. 
Entering the shell and typing the following is required to setup full disk encryption:
\\

#+BEGIN_SRC sh
    # fdisk -iy sd0
    Writing MBR at offset 0.

    # disklabel -E sd0
    Label editor (enter '?' for help at any prompt)
    > a a
    offset: [2104515]
    size: [39825135] *
    FS type: [4.2BSD] RAID
    > w
    > q
    No label changes.
#+END_SRC
\\

At this point I kept getting my error because I didn’t type **RAID** at ~FS type~. Instead, I pressed enter, which normally selects the default configuration in the OpenBSD installer.  
So when I proceeded to use the standard ~bioctl~ command:  

#+BEGIN_SRC sh
    # bioctl -cC -l sd0a softraid0
#+END_SRC
\\
I recieved a ~softraid~ error indicating an incorrect metadata format.

#+BEGIN_SRC sh
    softraid0: Invalid metadata format
#+END_SRC
\\
Once this was fixed I could move on to the next steps. You need to choose a custom layout for the disk and then do the following with disklabel making sure you have selected the correct mount point.

#+BEGIN_SRC sh
    > a a
    offset: [64]
    size: [6265286] *
    FS type: [4.2BSD]
    mount point: [none] /
    Rounding size to bsize (32 sectors): 6265280
    > w
    > q
#+END_SRC
\\
Now you should be asked for a password to secure your encrypted
drive. [[https://www.xkcd.com/936/][Make sure you pick a strong one.]]  

-----

#+BEGIN_QUOTE
 The world doesn't live off jam and fancy perfumes - it lives off bread and meat and potatoes. 
 Nothing changes. All the big fancy stuff is sloppy stuff that crashes. I don't need dancing 
 baloney - I need stuff that works. That's not as pretty, and just as
 hard.
   
/Theo de Raadt/
#+END_QUOTE



