10-04-2016-Disk-encryption-and-incomplete-metadata-format-on-OpenBSD-5.9.html
<!doctype html>
<html lang="en">
<head>
<title><a href="index.html"><code>stephen</code></a></title>
<!-- 2024-05-10 Fri 19:24 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<meta name="generator" content="Org-mode">
<meta name="author" content="Stephen Maxwell">

<link  href="https://cdnjs.cloudflare.com/ajax/libs/twitter-bootstrap/3.3.5/css/bootstrap.min.css" rel="stylesheet">
</head>
<body>
<div id="content" class="container">
<div class="row"><div class="col-md-3 col-md-push-9"><nav id="table-of-contents">
<div id="text-table-of-contents" class="bs-docs-sidebar">
<ul class="nav">
<li><a href="#sec-1">Disk encryption and incomplete metadata format on OpenBSD 5.9</a></li>
</ul>
</div>
</nav>
</div><div class="col-md-9 col-md-pull-3"><h1 class="title"><a href="index.html"><code>stephen</code></a></h1>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">Disk encryption and incomplete metadata format on OpenBSD 5.9</h2>
<div class="outline-text-2" id="text-1">
<p>
This is a brief summary of a user error during full disk encryption on <a href="https://en.wikipedia.org/wiki/OpenBSD">OpenBSD</a> which results in the error message <code>softraid0: Invalid metadata format</code>.
</p>

<p>
As per the manual, encryption is handled by <a href="http://man.openbsd.org/softraid">softraid</a> and <a href="http://man.openbsd.org/OpenBSD-6.0/bioctl.8">bioctl</a> and should configured during the initial boot install. 
Entering the shell and typing the following is required to setup full disk encryption:
<br >
</p>

<div class="org-src-container">

<pre class="src src-sh"># fdisk -iy sd0
Writing MBR at offset 0.

# disklabel -E sd0
Label editor (enter '?' for help at any prompt)
&gt; a a
offset: [2104515]
size: [39825135] *
FS type: [4.2BSD] RAID
&gt; w
&gt; q
No label changes.
</pre>
</div>
<p>
<br >
</p>

<p>
At this point I kept getting my error because I didn’t type <b><b>RAID</b></b> at <code>FS type</code>. Instead, I pressed enter, which normally selects the default configuration in the OpenBSD installer.  
So when I proceeded to use the standard <code>bioctl</code> command:  
</p>

<div class="org-src-container">

<pre class="src src-sh"># bioctl -cC -l sd0a softraid0
</pre>
</div>
<p>
<br >
I recieved a <code>softraid</code> error indicating an incorrect metadata format.
</p>

<div class="org-src-container">

<pre class="src src-sh">softraid0: Invalid metadata format
</pre>
</div>
<p>
<br >
Once this was fixed I could move on to the next steps. You need to choose a custom layout for the disk and then do the following with disklabel making sure you have selected the correct mount point.
</p>

<div class="org-src-container">

<pre class="src src-sh">&gt; a a
offset: [64]
size: [6265286] *
FS type: [4.2BSD]
mount point: [none] /
Rounding size to bsize (32 sectors): 6265280
&gt; w
&gt; q
</pre>
</div>
<p>
<br >
Now you should be asked for a password to secure your encrypted
drive. <a href="https://www.xkcd.com/936/">Make sure you pick a strong one.</a>  
</p>

<hr >

<blockquote>
<p>
The world doesn't live off jam and fancy perfumes - it lives off bread and meat and potatoes. 
Nothing changes. All the big fancy stuff is sloppy stuff that crashes. I don't need dancing 
baloney - I need stuff that works. That's not as pretty, and just as
hard.
</p>

<p>
<i>Theo de Raadt</i>
</p>
</blockquote>
</div>
</div>
</div></div></div>
<footer id="postamble" class="">
<div><p class="author">Author: Stephen Maxwell</p>
<p class="date">Created: 2024-05-10 Fri 19:24</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 29.3 (<a href="http://orgmode.org">Org-mode</a> 9.6.15)</p>
</div>
</footer>
</body>
</html>
